Revit API Introduction Labs
Lab4_2_ExportParametersToExcel Class
 Export all parameters for each model element to Excel, one sheet per category.
 This lab shws how to export all parameters of all elements in the Revit model to Excel, sorted by category into different sheets. We create a separate sheet per each category. The first row of the sheet is a header listing the parameter names for the given category. It is followed by a row of values for each element. Note that we need to reference the Excel COM library. There is no native .NET API available for the Microsoft Office products, so we use COM via COM callable wrappers, also known as COM-Interop in .NET.
 We implement a new command
CopyC#
Lab4_2_ExportParametersToExcel
. In a first step, we iterate over all elements and sort them into separate element sets, one for each category.
 At this point you can already compile and link the project, load and debug the command to analyse the categories and elements collected.
 Launch Excel via COM interop and remove the automatically created worksheets, as far as possible ... unfortunately, at least one remains, so we have to adjust the code populating them to account for the one left.
 Loop through the element sets for each category. For each category determine all occurring parameters and use these to create the header. Then loop through the elements and export their values one by one.
 Namespace: Labs
 Assembly: labs (in labs.dll) Version: 3.0.0.1 (3.0.0.1)
Syntax
C#
public class Lab4_2_ExportParametersToExcel : IExternalCommand
Visual Basic (Declaration)
Public Class Lab4_2_ExportParametersToExcel _
	Implements IExternalCommand
Visual C++
public ref class Lab4_2_ExportParametersToExcel : IExternalCommand
Inheritance Hierarchy
System.Object
 Labs.Lab4_2_ExportParametersToExcel
See Also
Lab4_2_ExportParametersToExcel Members
Labs Namespace